evidence/edt-5.1/2026-09-24/k6.txt
command=PERF_BASE_URL=http://127.0.0.1:3100 k6 run --summary-export evidence/edt-5.1/2026-09-24/k6-summary.json tests/perf/smoke.js
version=k6.exe v2.2.0 (commit/00a9a1b7f5, go1.26.5, windows/amd64)

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/perf/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * default: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  15.0s/15s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1200' p(95)=62.42ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 150     9.899259/s
    checks_succeeded...: 100.00% 150 out of 150
    checks_failed......: 0.00%   0 out of 150

    ✓ status 200

    HTTP
    http_req_duration..............: avg=9.54ms min=1.25ms med=5.34ms max=66ms  p(90)=10.93ms p(95)=62.42ms
      { expected_response:true }...: avg=9.54ms min=1.25ms med=5.34ms max=66ms  p(90)=10.93ms p(95)=62.42ms
    http_req_failed................: 0.00% 0 out of 150
    http_reqs......................: 150   9.899259/s

    EXECUTION
    iteration_duration.............: avg=1.01s  min=1s     med=1s     max=1.06s p(90)=1.01s   p(95)=1.06s  
    iterations.....................: 150   9.899259/s
    vus............................: 10    min=10       max=10
    vus_max........................: 10    min=10       max=10

    NETWORK
    data_received..................: 40 kB 2.6 kB/s
    data_sent......................: 12 kB 782 B/s



running (15.2s), 00/10 VUs, 150 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  15s
exit_code=0